{"comments":["Thanks!  We'll fix the typo in the source data and reload the description","This picture is actually kind of upsetting. I'm just curious as to why or who would let a group of blind kids try such dangerous gymnastics. It doesn't look like they have any supervision or anyone to spot their landing, yet someone was around to capture it on film. A little dissapointing...","yeah they should be kept in a padded room and constantly reminded that they are different from everyone else and they shouldn't try to do anything but read braille.  dumbass.","I never said they should be locked away and unable to experience life, maybe you shouldn't treat people so poorly and refrain from calling a me a &quot;dumbass&quot;  and notice that I was concerned about the well being of someone about to land flat on their back, blind or not this is a dangerous situation. No need to put immature comments up especially when you don't know what you're talking about.","I don't think he is actually about to fall, it seems to me this is more just a position or transition to another pose. You can see he has a firm grip on the pommel.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1022796@N24/\">Disability History</a>, and we'd love to have this added to the group!","This is photo #2 for 4/27/1911, according to the caption.  Please see my comment <a href=\"http://www.flickr.com/photos/library_of_congress/2162650585/\">in photo #1</a>.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1304007@N21/\">FLICKR PARA LA HISTORIA </a>, and we'd love to have this added to the group!","eu nem quero imaginar a queda feia dessa criatura XD","An Overbrook photo posted on LOC with this one:\n[http://www.flickr.com/photos/library_of_congress/2162650585/in/photostream/]\nAnother Overbrook photo, posted on LOC photostream in October, 2012:\n[http://www.flickr.com/photos/library_of_congress/8103240596/]\nA female pupil at Overbrook:\n[http://www.flickr.com/photos/library_of_congress/8147805765/in/photostream/]","<a href=\"https://en.wikipedia.org/wiki/Overbrook_School_for_the_Blind\" rel=\"noreferrer nofollow\">en.wikipedia.org/wiki/Overbrook_School_for_the_Blind</a>","Some biographical info on C-B-C <a href=\"http://query.nytimes.com/mem/archive-free/pdf?_r=1&amp;res=9C02E2DF1339EF3ABC4C53DFBE668389639EDE&amp;oref=slogin\">here</a> (warning - pdf).","I read the bio - and added a tag, &quot;mule.&quot;  This doesn't appear to be a horse, folks.  Mules are smart and long on endurance.","It is a horse- Just because it is ugly doesn't make it a mule.  It's ears are too small to be a mule","It's a horse. This horse is a descendant of the horses that the Spanish brought over and is typically called a &quot;cayouse,&quot; after the native tribe that used them. Look at some of Remington's works and you will see that most of the Indian and cow ponys of that time were like this pony. A tough breed and hard worker.","This is definitely not a mule -- the tag should be removed.  It's a horse that's not especially attractive, but not necessarily a cayuse either -- just a good, sturdy horse of mixed breed, apparently roan in color.  Frankly as long as the &quot;mule&quot; tag is removed the breed doesn't much matter.","Not a mule .    mules  in general have much longer ears","Tex Ritter. The singing Cowboy","Tex Ritter wasn't born then","Who gives one ?  It is a bloody gorgeous photo.  Thank you to the Library of Congress.","That's a horse, of course.","That's not a mule. Mules cannot levitate.","Is that a really big horse, or a really little man?","Another photo of him from Flick/LOC:\n<a href=\"http://www.flickr.com/photos/library_of_congress/2163451926/\">www.flickr.com/photos/library_of_congress/2163451926/</a>","That's a horse with an rather straight shoulder. That animal's trot must have been like a jackhammer.","I started an article on him:\n<a href=\"http://en.wikipedia.org/wiki/Sir_Genille_Cave-Browne-Cave,_12th_Baronet\">en.wikipedia.org/wiki/Sir_Genille_Cave-Browne-Cave,_12th_...</a>","Mammoth simply refers to height, all mules have large ears as they are sterile and not bred from mules, but the result of a horse and donkey, there is no way to breed small eared mules, not ones that look like horse ears. (therefore no mule breeds go &quot;extinct&quot; either, only horses). The size is also a giveaway.  A mammoth mule might be this big, but would still be a draft animal, not normally used for riding.  The thin mane and tail, large head and shading suggest this horse could be related to Appaloosas. He Started riding out west (see article) and that makes sense with this type of horse as well\n\nthe gentleman appears to have lived a colorful life.  This article years later states he was in the Spanish American war , a preacher, rode in the &quot;Wild West Show&quot;  and many other wonderful tidbits, later on he will the the Reverend Cave Brown Cave and write a book called From Cowboy to Pulpit. \nISBN:9781151601933\n[http://www.flickr.com/photos/29079609@N02/3319865520/]\n\n<a href=\"http://query.nytimes.com/mem/archive-free/pdf?res=9C02E2DF1339EF3ABC4C53DFBE668389639EDE\">query.nytimes.com/mem/archive-free/pdf?res=9C02E2DF1339EF...</a>","这张照片采集的真是太好了，西部牛仔生活，让我感觉不到现在机械化城市噪音的污染，真希望国家能够加大<a href=\"http://www.zaoyinzhili.com\">噪音治理</a>的力度让我们的国家<a href=\"http://www.zaoyinzhili.com\">噪音处理</a>理完善，让我们有个健康的生活环境","My comment was written for my own observation on the photo, there is no need to attack me.  I do know my donkeys and mules and stand by my comments. I do not say a donkey was  a mule. And yes, on rare occasions a mule will not be sterile but if you think they were used for actual commercial  breeding please provide proof. Since 1527 there have been just over  60 documented cases of foals born to female mules around the world. There are no recorded cases of fertile mule stallions. Non sterile offspring are extremely rare because donkeys have 62 chromosomes, and horses have 64.  As for mammoth, I was strictly referring to mules. As far as extinct goes, species go extinct,  mules are the species E. caballus x E. asinus, that species is not extinct.  There may be variations that can no longer be bred because of certain types of horses  or asses no longer exist but that is not the same thing as extinct in the conventional use I was employed.  I also did not miss, and do not think it appropriate in this forum that you imply a personal attack on me.  That was rather rude. However since your profile lists self absorption as your hobby I cannot be surprised.\n\nAnd yes Shijirltf, I agree totally with you.","So why is it you can explain yourself and you are the one being attacked, but when I support my input am attacking? I'm not the one who said &quot;know your ass&quot;.\n\n Again, I don't feel the generous LOC forum is the appropriate forum for this behavior therefore I am done with you.","Richard Arthur Norton and nudecowboy: Thank you for the additional information on  the very interesting Sir Cave-Browne-Cave!  We will update the source record to reflect these details.","you're very welcome!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/534552@N23/\">ANYTHING GOES ENGLAND,VINTAGE PHOTOS,POSTCARDS,EPHEMERAetc...</a>, and we'd love to have this added to the group!","A beautiful., old-timey type working horse. This is a great portrait of a time gone by, back when there were no ATV's to chase cows with...","The book by The Reverend Sir Genille Cave-Brown-Cave depicted above by nudecowboy is also in the Library of Congress:\n\n<a href=\"http://lccn.loc.gov/27002513\" rel=\"nofollow\">lccn.loc.gov/27002513</a>","I love that in those days the horses had less &quot;refined&quot; heads, and were chosen for their strength and abilities rather than their looks. Even today, the ranch cowboys from the Great Basin are tending towards the good working horse stature and away from &quot;pretty&quot;. My horses are in their late 20's and have the tiny feet that cause so many problems that were and still are being bred into &quot;backyard&quot; horses and horses shown at halter. They are big stocky Quarter Horses whose feet are too small for their bodies. This horse has the look I would enjoy seeing filling the pastures and arenas again.","Amos Strunk played Major League Baseball between 1908 through 1924\r\nMore on Amos Strunk here:\r\n<a href=\"http://en.wikipedia.org/wiki/Amos_Strunk\">en.wikipedia.org/wiki/Amos_Strunk</a>","Shouldn't that be Pa. instead of Al ?  Great picture.","AL is American League.","Nicknamed &quot;Cocky&quot;\r\n(Hit .365 in 1911)\r\n<a href=\"http://www.baseball-reference.com/c/collied01.shtml\">www.baseball-reference.com/c/collied01.shtml</a>","AL   or  PA?","AL in this case refers to the American League, not Alabama.","Other Bain/LOC photos of Eddie Collins:\n[http://www.flickr.com/photos/library_of_congress/4058474592/]\n[http://www.flickr.com/photos/library_of_congress/2679040177/]","beautiful !\r\n\r\nthat bain collection certainly made my day !","If this photo was taken in 1911, it would have been during Alexander's rookie season.  He won 28 games that year, a modern day rookie record.  He pitched for the Philadelphia from 1911 to 1917, then was traded to the Cubs. \r\n\r\nAlexander was one of the all-time greats and probably would have won 400 games if not for World War I.  He missed most of the 1918 season and returned with a bad case of shell shock or post traumatic stress syndrome.","Rookie? He looks like he's in his mid-late 40's.","he is a little wrinkly, but he was in his mid to late 20's when he was a Phillie..\r\n\r\n&quot;A for Alex\r\nThe great Alexander\r\nMore goose eggs he pitched\r\nThan a popular gander.&quot;\r\n                                                - Ogden Nash","More on pitcher Grover Cleveland Alexander here:\r\n<a href=\"http://en.wikipedia.org/wiki/Grover_Cleveland_Alexander\">en.wikipedia.org/wiki/Grover_Cleveland_Alexander</a>","I notice a lot of ballplayers from that era look a lot older than they actually are in their photos.  I guess it was hard living, poor diets, childhood illnesses…life really sucked back in those days.","16 shutouts in one year!!  (1916 maybe??)  in TINY Baker Bowl....incredible","yeah 1916, Grover was one of the greats, nice photo","fierce","After being the Boxing Champion of the World, Jimmy Clabby is said to have squandered over $500,000 in earnings, and was found dead of starvation in Calumet City during the Great Depression\r\nMore on Jimmy Clabby\r\n<a href=\"http://www.boxrec.com/media/index.php?title=Human:53088\">www.boxrec.com/media/index.php?title=Human:53088</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1304007@N21/\">FLICKR PARA LA HISTORIA </a>, and we'd love to have this added to the group!","This is such a great sports history photo, there is so much we can learn just from this one picture. One of the most noticeable things is how the athlete influences the wardrobe. By this I mean that we can appreciate the growth of the skill and strength of the athletes over time, and see that the size of the athlete and the accessories like the gloves have changed. Could you imagine if the modern brutes had these small padded gloves to hit with? We'd be talking career ending blows in a number of bouts.","Those are bag gloves, not boxing gloves for competition.","<a href=\"https://www.wikidata.org/wiki/Q41378138\" rel=\"nofollow\">www.wikidata.org/wiki/Q41378138</a>","Cool 😎","Great portrait and example of &quot;public domain&quot;.","Bill Bradley, (William Joseph Bradley), (1878-1954) was a third baseman in Major League Baseball. He was born in Cleveland, Ohio.\n\nBradley began his baseball career at the age of 19, in 1897, with the Burlington Colts. He played for the Chicago Orphans, and for 10 years in Cleveland (1901-1910). At the time of this photo he played three seasons with the Toronto Maple Leafs (1911-13). He retired after one season with Brooklyn and one season with the Kansas City Packers.\n\n&quot;Bill Bradley was recognized as one of the best third basemen in baseball prior to 1950, along with Jimmy Collins and Pie Traynor. He led American League third basemen in fielding four times, setting a league record of seven putouts in one game in both 1901 and 1909.&quot; &mdash;<i> [<a href=\"http://www.baseball-reference.com/minors/player.cgi?id=bradle004wil\" rel=\"nofollow\">1</a>]  [<a href=\"http://en.wikipedia.org/wiki/Bill_Bradley_(baseball)\" rel=\"nofollow\">2</a>]</i>","The team is probably the Minor League Toronto Maple Leafs (baseball team not the NHL team)","he looks a little too much like ray liotta for my comfort.","Why, sure enough . . . .\n[http://www.flickr.com/photos/keithsphotos6/3737082356/]","Would you say he's Mullin something over in his head?","Behind him is the newly opened Maple Leaf Stadium, which was opened in 1910, made of concrete, seating 18,000 to replace the ones burnt by fire. Located on the Toronto Island at Hanlan's Point, the legendary Babe Ruth hit the first home run of his professional career here on September 5, 1914, the ball landing in Toronto Harbour.","Of course: a chew of 'baccy firmly in place.","Baseball stats for Fred Luderus here:\r\n<a href=\"http://www.baseball-reference.com/l/luderfr01.shtml\">www.baseball-reference.com/l/luderfr01.shtml</a>","Love the sweaters many of the players are sporting in this era.  Hey: somebody should bring out a retro line of these; sporting and practical.","Sherry was just 19 years old when he debuted with the Philadelphia Athletics in 1904.  An outfielder, Sherry had his best year in 1910 leading the league in hitting with a .331 average, runs scored with 110 and RBI's with123. Sherry also swiped 49 bases. He finished his 16 year career with a .291 batting average.","More about Sherry Magee here:\r\n<a href=\"http://en.wikipedia.org/wiki/Sherry_Magee\">en.wikipedia.org/wiki/Sherry_Magee</a>","Thats my great great great grandfather.","Kosh_ms3,\n\nI grew up in Philly, playing and watching baseball religiously. When I was fourteen I read about your great, great, great grandfather.  My best friend and I adopted him as an immortal baseball legend.  We knew everything there was to know about Sherry Magee.  I'm now thirty-eight and continue to be a HUGE fan of what he accomplished as a ballplayer.  When I found this picture online I immediately had two copies printed, one for myself and one for my childhood friend.  The memory of your great, great, great grandfather will live on in our homes for many years to come.","Excellent bio of Magee on the Society for American Baseball Research's BioProject website: <a href=\"http://bioproj.sabr.org/bioproj.cfm?a=v&amp;v=l&amp;bid=938&amp;pid=8658\">bioproj.sabr.org/bioproj.cfm?a=v&amp;v=l&amp;bid=938&amp;...</a>","susan4508: thanks for the link to the biography of Magee. We will update the information and reload the description.","Sherry Magee was a professional baseball player from 1904 until 1919.  He played for the Philadelphia Phillies, Boston Braves, and Cincinnati Reds.  He played left field for most of his career, and he batted and field right-handed.  He posted a career batting average of .291.","nowadays who needs sweaters like that especially in Florida","Wonder if he took any ribbing for that name?","A cousin of mine...Believe it or his nickname was &quot;Gook&quot;...No idea why...","More about Wid Conroy here:\r\n<a href=\"http://en.wikipedia.org/wiki/William_&quot;Wid&quot;_Conroy\" rel=\"nofollow\">en.wikipedia.org/wiki/William_&quot;Wid&quot;_Conroy</a>","Here is an article on him:\r\n<a href=\"http://en.wikipedia.org/wiki/Maurice_Roche,_4th_Baron_Fermoy\" rel=\"nofollow\">en.wikipedia.org/wiki/Maurice_Roche,_4th_Baron_Fermoy</a>\r\n\r\nand here is photo of his sister, it seems.\r\n<a href=\"http://www.flickr.com/photos/library_of_congress/2162654261/in/set-72157603624867509/\">www.flickr.com/photos/library_of_congress/2162654261/in/s...</a>","Seems he had a fairly famous granddaughter :-)","I like these types of people","He seems having fun. Nice. Thanks for the share.","More on Long Tom Hughes here:\r\n<a href=\"http://en.wikipedia.org/wiki/Long_Tom_Hughes\">en.wikipedia.org/wiki/Long_Tom_Hughes</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/409427@N24/\">Lost Ballparks</a>, and we'd love to have your photo added to the group.","The Highlanders, you probably all know, were the forerunners of the Yankees.   Hilltop Park was where Columbia Presbyterian Medical Center is now.","yes, and Home Plate is still there!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1202064@N21/\">Baseball-Babe Ruth Old and Modern inspired images,field of dream</a>, and we'd love to have this added to the group!","Of note:\r\n&quot;He is known as the creator of the 'emery ball', a pitch that was thrown with a ball that had been scuffed with a piece of emery. Ford won 26 games in his rookie season of 1910, becoming only the third player in major league history to win 20 games and strike out at least 200 batters in his first season. (Christy Mathewson and Pete Alexander are the others)&quot;\r\nAlso of note, Ford was born in Brandon, Manitoba, and was inducted into the Canadian Baseball Hall of Fame in 1989.","I guess &quot;emery balls&quot; were legal back then.","More on Russ Ford here:\r\n<a href=\"http://en.wikipedia.org/wiki/Russ_Ford\">en.wikipedia.org/wiki/Russ_Ford</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/20595373@N00/\">Face Time</a>, and we'd love to have this added to the group!","An even better bio of Russ Ford (and about 900+ other ballplayers) is at: <a href=\"http://bioproj.sabr.org/bioproj.cfm?a=v&amp;v=l&amp;bid=1758&amp;pid=4589\">bioproj.sabr.org/bioproj.cfm?a=v&amp;v=l&amp;bid=1758&amp...</a>","they weren't officially the Yankees yet in 1911, they were still the New York Highlanders.","That camera is going on my Amazon wishlist right now.","Everybody needs a volkswagen-sized camera. This is brilliant.","Wonderful image. I'm so glad the LOC is up here. This is going to be a heck of a lot of fun!","This is amazing.","To carry that camera around all day.... \r\nMakes me glad we have digital cameras now.","i would like to have one of those cameras if you still have one like that","<a href=\"http://www.baseballlibrary.com/ballplayers/player.php?name=Germany_Schaefer_1877\">www.baseballlibrary.com/ballplayers/player.php?name=Germa...</a>","Greetz from Germany to Germany :-)","Wow! The size of that camera!","This picture is of 1911. In a Dutch paper of may 1895 I found an ad for lighter camera's, special for ladies:\r\n<a href=\"http://gelkinghe.web-log.nl/gelkinghe/2007/12/geen_vakkennis_.html\">gelkinghe.web-log.nl/gelkinghe/2007/12/geen_vakkennis_.html</a>","Even back then people thought it was funny to take a picture of someone taking a picture.  Some things never change.","That camera wouldnt fit in my purse!","You might find this camera a little larger:\r\n\r\n<a href=\"http://robroy.dyndns.info/lawrence/\">robroy.dyndns.info/lawrence/</a>","oh! i'm sure it's really heavy, but this camera delivered finest and clear photos, i wish i have those camera as my collections 'a vintage camera'.","Very funny that he is still wearing his glove! Must have been a novelty shot. Great to see the LOC here on flickr.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/63919830@N00/\">In the Studio</a>, and we'd love to have your photo added to the group.","and I thought I had it tough!","What no auto focus","I don't think that's a camera--it may very well be the the first practice pitching machine...","It's neat to see an old camera like that-- especially in the hands of a ballplayer!","simplesmente muito show. Fico imaginando o peso disso.","Pictures like this make me realize how dull digital cameras are.  Imagine the same picture but with him using an iPhone camera?  Nowhere near as flavorful.","What a great shot.","I love it! What a monster of a camera.","Wow 1,000,000 digital pictures. Thanks for making these available. It sure makes it great for research. \r\nWonder where the picture is he took with that huge camera?","Must have been a very chilly day in April, the gentleman in the background bundled up, and the ball player wearing longjohns under a woolen baseball uniform.","I believe that this particular camera is a Telephoto Graflex SLR that used 5x7 inch glass plates or film.  The lenses were interchangable,\r\nand were all long-focus types, usually pretty fast for the time (like f/4.5). The camera had a vertical-traveling cloth focal-plane shutter capable of action-stopping speeds like 1/1000 sec.  It is  similar to the type of camera used by Jacques-Henri Lartigue, Alfred Stieglitz and Paul Strand.\r\n\r\nJon","Beyond large.","The composition is awesome .. the flag and the crowd shows the image of the player and the edges remind us the age of the picture .. truly classical","Wonderful Picture.","This is wonderful...Everything is fantastic from the old fashioned camera, to the clothes, and baseball!!! Can't get more American than that!","id love to see the photos taken by him...lol","Excelente fotografía...........!!!!!\r\n\r\nTe invito cordialmente al grupo <a href=\"http://www.flickr.com/groups/626552@N25/\">PHOTOGRAPHERS / FOTOGRAFOS</a> y nos encantaría agregar esta y otras fotos tuyas sobre el tema. Saludos.......!!!!!","Hola, soy el administrador de un grupo llamado <a href=\"http://www.flickr.com/groups/626552@N25/\">PHOTOGRAPHERS / FOTOGRAFOS</a> y nos encantaría agregar tu foto al grupo.","wow. now that is a camera. these shots are all fascinating. :)","Funny picture of Germany Schaefer. It is hilarious how he looks, how big the camera is and how he is holding it. Even the guy in the background with the top hat looks like he is laughing.","looks like a barrel lens\n\n--\n<i><a href=\"http://www.flickr.com/groups/h-largeformat/discuss/72157603773350960/\">Seen in a discussion of Handheld Large Format Camera.</a></i> <em>(<a href=\"http://6v8.gamboni.org/Flickr-Add-referer-into-comments.html\">?</a>)</em>","&quot;This photograph is a WINNER!&quot;\n<img src=\"http://i71.photobucket.com/albums/i130/celine_uh/cet.jpg\" width=\"83\" height=\"74\" alt=\"Best of Flickr\" />\n<a href=\"http://flickr.com/groups/bestofflickr/\">the BEST of Flickr!!!\n\n**********PREVIEW***********\nThis photograph is a WINNER!\nBest of Flickr\nthe BEST of Flickr!!!</a>","BEHOLD! the creator of FlickR and his camera!","Fantastic image!","last time the brewers were in the playoffs","wow, hard to make a pic on the right time. Good one!","Hola, soy el administrador de un grupo llamado <a href=\"http://www.flickr.com/groups/664157@N20/\">Antiguas</a> y nos encantaría agregar esto al grupo.","this photo was very classic,fantastic and so bombasstic!!! i wish i can turn back the time...and be one of the humans in this photo =)","Great photo of a pilar in photography. For our fellow photographers in the past their trade was no easy task, and their equipment cumbersome...but it worked as a stepping-stone for better equipment and lovely photos !!!","Cuidate .","I try my best to keep healthy and safe...","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/676473@N21/\">Almost Anything FRUIT AND VEG COMP... Get entering.</a>, and we'd love to have this added to the group!","That's the &quot;pocket&quot; version large format.  ;O) \nWhat Backache?","What a fabulous photo!  Love the melding of sports and photography!  I had no idea this ballplayer even existed, and we shared a last name at one time.\n\n--\n<i><a href=\"http://www.google.com/search?q=germany+schaefer&amp;ie=utf-8&amp;oe=utf-8&amp;aq=t&amp;rls=org.mozilla:en-US:official&amp;client=firefox-a\">Found in a search.</a></i> <em>(<a href=\"http://6v8.gamboni.org/Flickr-Add-referer-into-comments.html\">?</a>)</em>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/441825@N20/\">Photographed Photographers</a>, and we'd love to have this added to the group!","&quot;snap&quot; .......now he's a shutterbug !","I wonder if the tripod was horse drawn?","Think it comes with a back brace?","espetacular memoria.","Does this camera have a phone in it?","This is A photographer!. Nothing of mini digital cameras!.\nGreat find!.","Looks like a portable washing mashine :D\n\n...those cameras are awesome, I wish I own one, to be honest.","do think it would pass as hand luggage? lol!!","Amazing camera!  I bet the final print was amazing!  Thanks for posting it.","Damn! That has evolved!","I think you had to be quite fit back then if you wanted to be a fotografer","太棒了我很喜欢照相，城市的<a href=\"http://www.zaoyinzhili.com\">噪音治理</a>不是很好我经常去野外照相感觉非常的好。","Germany was quite a character back in the day. You can read about him in this book: <a href=\"http://www.amazon.com/Man-Who-Stole-First-Base/dp/0878336338\">www.amazon.com/Man-Who-Stole-First-Base/dp/0878336338</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1021624@N25/\">Your favourite photos</a>, and we'd love to have this added to the group!","Foi o meu pai que tirou essa foto","Amazing!","look at the size of that thing!","Good to see, we can't imagine!","I suppose it was a lot easier to go to the baseball park with that equipment than a national park.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1036398@N20/\">BLACK &amp; WHITE=BLANCO Y NEGRO</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1046640@N24/\">AMPLIADORA =FILM &quot;ojo solo fotos analogicas&quot;</a>, and we'd love to have this added to the group!","FABULOUS photograph!!! Thanks for bringing it!!","There were a number of shots taken of old cameras and their photographers. Not as much as today but it still was done. \nThis belongs In Explore!\n\n--\n<i><a href=\"http://www.flickr.com/groups/passiveaggressive/discuss/72157617834775355/\">Seen in a discussion of  Post 1 leave 3 passive aggressive comments, notes, or tags.</a></i> <em>(<a href=\"http://6v8.gamboni.org/Flickr-Add-referer-into-comments.html\">?</a>)</em>","No wonder it isn't in Explore. There's no EXIF data for Glass negatives.","Germany Schaefer was born in 1876, not 1877.\n\nThe New York Highlanders ultimately became the New York Yankees.","great... is not ultra slim cam","Viajante:  It appears that you are correct about Germany's birth year.  We found some citations for 1877 and some for 1876.  A biographer from the Society for American Baseball Research helped us confirm the correction.   Thanks for catching this!  We'll correct the source data and the description above.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1081984@N20/\">Fotograf - photographer - photographe - el fotógrafo</a>, and we'd love to have this added to the group!","Warm Greetings:\n\nThis is an exemplary shot! We have to pause and really consider how far photography has really advanced and/or evolved. For those of us who have worked in (the chemistry end of) the earlier photography medium I'm sure there is the utmost respect, and appreciation for the craft, in those former days. \n\nThere was a whole preparation, process, and final rendition of whatever capture that was sought- it certainly wasn't instantaneous, but in fact the photographers of that day (beyond amateurs) had to think spontaneously and were often able to capture the most opportune moments. Sometimes the most dynamic moments weren't preplanned and when photographed in that manner it created a legacy of some of the most enduring images to date...\n\nTruly, we can witness the science of photography at its best! Homage to all of the early trail blazers, pioneers, and those following after... It's a great legacy!\n\nTenga La Paz!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1019427@N23/\">Nation Of Domination. (We Rule The Universe)</a>, and we'd love to have this added to the group!","I thought finding polaroid 600 series film was difficult.  I can only imagine trying to track down some glass negative 5x7 these days.","The New York Highlanders, by the way, are the predecessors to the modern-day New York Yankees.  They became the New York Yankees in 1913 when they moved to the Polo Grounds.","&quot;This digital image represents the millionth item scanned for the Prints &amp; Photographs Division at the Library of Congress.&quot;\n   \n      Thank you for all of the work you are doing!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1015395@N21/\">Wir haben`s schwarz auf weiss ONLY THE BEST IN B&amp;W  ART♥ ♥</a>, and we'd love to have this added to the group!\n\nIt`s wonderful !","camara portatil??!!","I can't  imagine how big the cary bag for such big camera like this or maybe backpack would be fit?.\n\nI love we still have this one even on a pic","oh the prehistoric era of the camera \nshocking wht technology has come too","=9","A google search revealed he was 35 when this picture was taken.","wow !! thats old !!!!","amazing! O.o","i like it","really interesting.  my apartment is smaller than that camera","And folks today complain about the weight and size of dSLR's...LOL!! ;-)","Great, but does it come with drivers for OSX, Snow Leopard?  :-)","Ha ha ....good one kirk!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1240342@N25/\"> Show  ur  Snaps</a>, and we'd love to have this added to the group!","I wanna to see the photo which he making in the moment..","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1202064@N21/\">Baseball-Babe Ruth Old and Modern inspired images,field of dream</a>, and we'd love to have this added to the group!","wows","Added to the gallery, <a href=\"http://www.flickr.com/photos/14841959@N06/galleries/72157623277111549\">More Oddities From the Commons</a>.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1355708@N21/\">The Photographer Photographed (People who take Photographs)</a>, and we'd love to have this added to the group!","&quot;This new Ixus prototype still needs a bit of work before we start to sell it!&quot;","woooww.. Cool..","Makes me want to laugh...","Oh, it's so nice!!!!","Germany Schafer, for those of you who are interested, was  the only baseball player to steal second base, then steal first base, and then second base again in the same inning.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1094803@N22/\">free and proud</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/591987@N24/\">soulful group</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1050819@N21/\">a new world</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1235740@N21/\">brilliant  magic</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/972473@N24/\">piece of heaven</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/916084@N25/\">Best Pictures of The World</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1189972@N22/\">the road leading to x</a>, and we'd love to have this added to the group!","cool history..","Congratulations!\nThis is a wonderful shot!\nYou are invited to post it to: \n\n<a href=\"http://www.flickr.com/groups/artland/\"> <img src=\"http://farm4.static.flickr.com/3447/3789880871_7381296df7_m.jpg \" /></a>\n<b> <a href=\"http://www.flickr.com/groups/artland/\">artland </a></b>","Thanks for giving us an oportunity to see how cameras used to be.\nWhat ever the obstacles, people still had the passion to use them.","The camera pictured is a <a href=\"http://www.speedgraphic.fr/Pressuk.html\" rel=\"nofollow\">5x7 Press Graflex</a>","By George, bruce grant, I think you've got it. It sure looks like a match to me. I'm going to pass your discovery around for review, and if there is consensus, we'll add the information to the record the next time we update.  Thank you!","very cool!","Wow!....Just...'Wow!' :)","You guys at The Library of Congress' do an amazing jobb! Thanks for keeping the past :)","well done","(:","They tell me this new iPhone 40 will not be a problem going through airport security.","Amazing document, beatifull capture , his face is fantastic. beautiful picture.","LF hand held.\nNever thought I'd seen it.","Probably taken with a similar camera? Excellent image quality!","niice picture \n\ni realy loved it ^^\n\nkeep it up","great photo","[http://www.flickr.com/photos/rebeccarosell] hai............","Schaefer seems to have been a born clown. \nOne wonders what prank he was up to here?\nI am like the other camera buffs,and collectors.\nWould i love to have one of those~!!","ihkris","I can imagine, when that focal plane dropped, you could hear it.","Fantastic !","My two favorite things.","[http://www.flickr.com/photos/33546386@N03]","[http://www.flickr.com/photos/83065128@N07]","like this!","Excellent  photo!\nSelected for my galleries of special photos","On behalf of Camera-Wiki :\nThanks for adding your image to the Camera-Wiki Flickr group !\n<a href=\"http://www.flickr.com/groups/camerawiki/\">www.flickr.com/groups/camerawiki/</a>\n\nIt appears here in the non-commercial Camera-Wiki :\n<a href=\"http://camera-wiki.org/wiki/Press_Graflex\" rel=\"noreferrer nofollow\">camera-wiki.org/wiki/Press_Graflex</a>","Now this is a street shooter.","Just made for a snapshot","I think this could have been scanned flipped... The dates might actually read, (top left) 4/22/11 (4/22/1911), and (side left) SS 2/20/15 (2/20/1915) Top middle SCHAEFER (WASHINGTON) printed in reverse.\nAfter downloading the hi-res and unsharpened mask, I horizontally flipped the image, sometime people would mark the negatives on the opposite-emulsion side. The cropping seems to me a 5 x 7 negative too. so could be same camera shooting the baseball player! pretty cool.","Germany Schaefer's shirt buttons are in the correct direction so the photos is in the correct orientation. If you look at some of the Bain photos taken around the same time you'll they see they usually have the title and dates in the same orientation as this image.","Magnificent photographic document!","It seems the cabin is actually in Oakland California:\r\n\r\n<a href=\"http://en.wikipedia.org/wiki/Joaquin_Miller\">en.wikipedia.org/wiki/Joaquin_Miller</a>\r\n\r\n<a href=\"http://en.wikipedia.org/wiki/Image:Miller_cabin.jpg\">en.wikipedia.org/wiki/Image:Miller_cabin.jpg</a>","Exile Bibliophile - they're two different structures.  The one show here is now in D.C.'s Rock Creek Park:\r\n\r\n<a href=\"http://www.washingtonhistory.com/ScenesPast/images/SP_0607.pdf\">www.washingtonhistory.com/ScenesPast/images/SP_0607.pdf</a>\r\n\r\nWhen this photo was taken, it was located on Washington's Meridian Hill, in the area now occupied by Meridian Hill Park.  The cabin was moved by the Park Service in 1913.","It's now near the old Milkhouse Ford in Rock Creek Park.\n\n<a href=\"http://www.flickr.com/photos/greatphotographicon/2856820773/\"><img src=\"http://farm4.static.flickr.com/3071/2856820773_e005c008e9_m.jpg\" width=\"240\" height=\"160\" alt=\"Cottage in Rock Creek Park\" /></a>","On pages 385-386 of his book of memoirs, &quot;Roadside Meetings&quot; (1930) Hamlin Garland recalls a week he spent in Chicago in 1898, with the visiting Joaquin Miller:\n\nHe [Miller] told us of his life in Washington City and of the log cabin he had built out near Rock Creek. \n&quot;I made that my home for four years, but I was away much of the time. I didn't like it there. Congressmen and their silly wives wore me out. They all came to Washington as the great men in little towns, and their women, raw, silly, curious, had nothing better to do than to seek out Joaquin Miller, 'the man who lived in a tree.' They made life miserable for me and I fled.&quot;","Wystan: Love this kind of anecdotal tidbit - one that shows up in an obscure source that you'd never think to look in (or find with a keyword or subject search in a library catalog) if you were researching the subject!\n\nInteresting that he uses &quot;the man who lived in a tree&quot; - I wonder if this wasn't a misremembering of Miller's rant by Garland, since Miller's cabin was not far from <a href=\"http://www.historydc.org/library/searchcatalog.aspx?Mode=4&amp;ID=81604&amp;NUM=ALL\" rel=\"nofollow\">&quot;Airy Castle&quot;</a>, the tree house of Allen B. Hayward, when he lived on Meridian Hill:\n\n<a href=\"http://chroniclingamerica.loc.gov/lccn/sn84026749/1907-02-17/ed-1/seq-36/\" rel=\"nofollow\">chroniclingamerica.loc.gov/lccn/sn84026749/1907-02-17/ed-...</a>\n\nHayward brought a lot of curiosity-seekers to what was then otherwise a comparatively quiet part of the District.","rockcreek: I found Garland's book at Ann Arbor's ReCycle Center a week ago, and have enjoyed reading it in odd moments. In an earlier chapter, Garland recalled his visit to Miller at Miller's orchard, &quot;The Hights,&quot; overlooking Oakland, California.\n\nA July 2, 1911, New York Times story reported plans to dismantle cabin in Washington and rebuild it in Oakland:\n<a href=\"http://query.nytimes.com/mem/archive-free/pdf?_r=1&amp;res=9C06EED61031E233A25751C0A9619C946096D6CF\" rel=\"nofollow\">query.nytimes.com/mem/archive-free/pdf?_r=1&amp;res=9C06E...</a>\n\nThe threat of removal prompted D. C. officials to move the cabin and restore it. Here's Wikipedia's take on the brouhaha:\n<a href=\"http://en.wikipedia.org/wiki/Joaquin_Miller_Cabin\" rel=\"nofollow\">en.wikipedia.org/wiki/Joaquin_Miller_Cabin</a>","Wystan: Looks like the <i>Times</i> got their sources muddled there - there is no Rock Creek Park in Oakland (or at least there isn't now), and the cabin in DC's Rock Creek Park <i>is</i> the one that Miller lived in on Meridian Hill, although it has been altered over the years.\n\nMiller died in Oakland, and his house there is still standing (and on the National Register), however:\n\n<a href=\"http://tps.cr.nps.gov/nhl/detail.cfm?ResourceId=111&amp;ResourceType=Building\" rel=\"nofollow\">tps.cr.nps.gov/nhl/detail.cfm?ResourceId=111&amp;Resource...</a>","Bain/LOC photo of the reconstructed Miller cabin on the day of its dedication in Rock Creek Park, June 12, 1912:\n[http://www.flickr.com/photos/library_of_congress/2163929800/in/photostream/]\n\nThe public dedication ceremony, June 12, 1912:\n[http://www.flickr.com/photos/library_of_congress/2163129925/in/photostream/]","Possibly the 1911 dock strike?","what an amazing shot. I would be nervous getting in front of that scene with a digital camera -- that photographer sure was a brave one.","Number 8 bus from Mile end via Bank, Aldwych, Trafalgar Square. I think this might be somewhere round the Aldwych as there's a theatre on the right. Sadly, though it does still go past Bank, the Number 8 no longer runs this <a href=\"http://www.tfl.gov.uk/assets/downloads/Central-London-Day-Bus-Map.pdf\"> route. </a>","Check out the fingerprint on the policeman's trousers","Well spotted!","very slip shod way of presenting this picture you would think that they would show two versions    as is and cleaned and squared up","ahh - back in the days when EVERYONE wore hats...\r\n(try to spot someone NOT wearing a hat)\r\nSuper collection - I love it !","that could be the  finger prnt of the photographer.... retouchng old images is a different matter.... the imperfections are part of the image and its personal history...","The date given is wrong. This is the general strike, which happened between 3 and 13 May 1926. If you look carefully you'll see the date in the top right corner mirrored. It says 5/4/26 which, since it is written by an American, means it is 4 May 1926.","You could well be right, Steven. It looks like 4 May 1926 to me too. But it might be the same 22.4.7 -4 that's written at the bottom of the photo - a reference number rather than a date. These photos come from the Bain News Service collection and were mostly taken in 1911-12. The entire collection spans 1900 - 1920, so it's hard to see how so many photos from 1926 would have crept in among the relatively few of Great Britain. \r\nThis link will tell you more: <a href=\"http://flickr.com/photos/library_of_congress/sets/72157603624867509/\">flickr.com/photos/library_of_congress/sets/72157603624867...</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/634483@N20/\">Police History</a>, and we'd love to have your photo added to the group.","There were certainly  transport strikes during 1911, in which the police had to keep the peace. \r\n\r\nThese officers are NOT wearing medal ribbons, which I am sure they would have done had it been post-WWI.","Thanks for adding this to the <a href=\"http://www.flickr.com/groups/policehistory/pool/\">Police History</a> Group\r\n\r\n--\r\n<i><a href=\"http://www.flickr.com/groups/policehistory/pool/\">Seen in Police History</a></i> <em>(<a href=\"http://6v8.gamboni.org/Flickr-Add-referer-into-comments.html\">?</a>)</em>","The police look like City of London police with their distinctive helmets and the heraldic shield in the top right hand corner looks like one of the City heraldic city demarcation symbols . \n\nIt was probably taken along the No 8 Bus route which runs \n\nhere:\n\n<a href=\"http://en.wikipedia.org/wiki/London_Buses_route_8#History\">en.wikipedia.org/wiki/London_Buses_route_8#History</a>\n\nSo I am not sure if it is Aldwych unless it is running off route because of the strike","The no 8 bus looks like a <a href=\"http://www.ltmcollection.org/photos/photo/photo.html?_IXMAXHITS_=1&amp;_IXSR_=9f5PL_eGQ_e&amp;IXsummary=themes/theme_sub&amp;IXtoptheme=Buses&amp;IXrefine=B-type&amp;_IXFIRST_=9&amp;IXenlarge=9889290\">B-type</a>, introduced in 1910, so that would fit with 1911.","There was a dock strike in London in July of 1912.\n\n&quot;Mounted police outside a building during the 1912 dockers strike. The pre-war era witnessed massive industrial unrest as dockers, transport workers, miners and other workers pressed for higher wages and better conditions. The strike wave only ended with the outbreak of war in 1914.&quot;\nSource: Newham Archives and Local Studies Library Collection\n\nSee images from the Newham Archives and Local Studies Library Collection:\n<a href=\"http://www.portcities.org.uk/london/server/show/conMediaFile.242/Police-mobilising-during-thedocksstrike-of-July-1912.html\">www.portcities.org.uk/london/server/show/conMediaFile.242...</a>\n\nThere was also a National Coal Strike of 1912.\nSource: <a href=\"http://dspace.dial.pipex.com/town/parade/abj76/PG/pieces/lawrence/national_coal_strike.shtml\">dspace.dial.pipex.com/town/parade/abj76/PG/pieces/lawrenc...</a>","I would say this is in The City and the next time I am their I will pop along and try and find out the exact location and photograph it today.","Very very tough to do... most of the city was bombed out of existence.","The starched collar on the tradesman on the right, the lack of lamps on the bus and all the boater hats, rather than trilbys, set this earlier than 1926. Even the weather (sharp hat shadows) looks wrong for May '26. Also note the pre WWI absence of women! Compare <a href=\"http://www.nationalarchives.gov.uk/cabinetpapers/images/cabinetpapers/gs-starter.jpg\">www.nationalarchives.gov.uk/cabinetpapers/images/cabinetp...</a> and the bus in <a href=\"http://www.nationalarchives.gov.uk/cabinetpapers/images/cabinetpapers/gs-diary.jpg\">www.nationalarchives.gov.uk/cabinetpapers/images/cabinetp...</a>\nI wonder if the date was added to an older photo in order to sell it to US papers during the UK General Strike of '26..?","I doubt it - if  the clothes and buses seem dubious to us at this remove, then surely they would scream out at a contemporary readership. Surely horse-drawn trucks would have been outmoded by 1926?\n\nI think it must be a reference number, rather than a date.","Here is a picture from the 1926 General Strike in London:\n\n[http://www.flickr.com/photos/castlekay/2387290583/]","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/534552@N23/\">ANYTHING GOES ENGLAND,VINTAGE PHOTOS,POSTCARDS,EPHEMERAetc...</a>, and we'd love to have this added to the group!","Was it a requirement for London Bobbies to have mustaches?? ;-)","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1304007@N21/\">FLICKR PARA LA HISTORIA </a>, and we'd love to have this added to the group!","Hi LC,\n\nThis is a nice photograph.\n\nI've done a bit of writing on London buses at\n<a href=\"http://www.ravishlondon.com/londonbuses/\" rel=\"nofollow\">www.ravishlondon.com/londonbuses/</a>\n\nAnd I'd love to feature this photo if possible.\n\nIn return I could provide a credit and a link back to your site.\n\nWhat do you say?\n\nRegards\nRL","@londonstreetart2 -- The historical photographs in the Flickr Commons are offered with &quot;No known copyright restriction&quot; and &quot;No known publication restriction.&quot;  Your credit and link back are appreciated! -- Helena (LOC)","Hello LOC,\n\nThanks for giving me permission to use your photo.\n\nI have now posted the photo on the article.\n<a href=\"http://www.ravishlondon.com/londonbuses/index.html#horsedrawnbus\" rel=\"nofollow\">www.ravishlondon.com/londonbuses/index.html#horsedrawnbus</a>\n\nI have provided with you with a credit, and a link, which can be accessed through clicking on your name.\n\nIs this OK with you?\n\nIf you have any problems please do not hesitate to contact me.\n\nRegards\nRL","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/810972@N21/\">Pith Helmets</a>, and we'd love to have this added to the group!","Probably taken during the Turco-Italian war of 1912, no?\n\n<a href=\"http://www.warchat.org/history-europe/italo-turkish-war-turko-italian-war-1912.html\">www.warchat.org/history-europe/italo-turkish-war-turko-it...</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1304007@N21/\">FLICKR PARA LA HISTORIA </a>, and we'd love to have this added to the group!","hi i'm admin for group too in Facebook i loved to have this added to group his name is &quot; history of libya &quot; &amp; thank's allot","As I can observe, boat technology has advanced very much. But social classes remain through times.","I was there, you can see me...gal in the hat, third from the left. Them were good times.","Looking at the dress code for this boating outing, I would need say it is a far cry from the bikini (some times topless) and speedo  clad men that are observed at the modern day cove parties.","G@zu, in fact boat tech has remained largely similar too. . .","Looks the same!","Preciosa vista.Saludos.","&quot;Newport will see a lot of the New York Yacht Club on its annual cruise, which will sail into Newport Harbor Aug. 9, on Friday, and remain until the following Monday morning. This means a round of social activity ashore and afloat.&quot; \n\n-----From a New York Times story (June 30, 1912) on the upcoming summer social season at the resort town of Newport, R. I.","Other Bain/LOC photos of the New York Yacht Club landing at Newport, Rhode Island:\n[http://www.flickr.com/photos/library_of_congress/2162916759/]\n[http://www.flickr.com/photos/library_of_congress/2163717572/]","<a href=\"http://en.wikipedia.org/wiki/N.Y._Yacht_Club\" rel=\"nofollow\">en.wikipedia.org/wiki/N.Y._Yacht_Club</a>","Amazing.","Looks like he was working in the off season.  I wonder what his job was?","Back in the days, most ALL ballplayers worked between seasons...back when sports were sports, not businesses.","He looks more like a foot ball player than baseball","That's a railroad baggage wagon for passenger trains.  My job during the mid-sixties was baggage man /  mail handler for the IC and the wagons were the same then too.","baseball great !!!","The title is a little confusing.\r\n\r\nThis is <i>not </i> Cy Young! It's &quot;young Cy Young&quot;, who lost 21 games for the Boston Braves in the same year that the <i>real </i>Cy Young pitched for the Boston Americans. You can check it out on Google.\r\n\r\nIt's a wonderful picture anyway.","Call him Irv Young. See: <a href=\"http://www.baseball-almanac.com/players/player.php?p=youngir01\">www.baseball-almanac.com/players/player.php?p=youngir01</a>","Jack Lo P.: Sorry for the confusion. Even though there was a note in the catalog description to provide the full name of Irving Melrose, it sounds like we need to follow Kayak49's advice and add &quot;Irv Young&quot; directly to the title. Will do!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/586034@N24/\">Black and White Portraits/Denver</a>, and we'd love to have this added to the group!","re the title. the only move which would begin to achieve clarity is to remove the quotation marks from &quot;Cy&quot;. if the marks remain then everyman in the US is going to assume it is &quot;the&quot; Cy Young.\n\nWhile using quotation marks around a nickname is proper, what could excuse their removal in this instance is the fact that he seems to have half a dozen names. obviously not all of them are his Proper name. If the marks are not removed then alternatively they may also be candidates for quotation marks if following standard punctuation since alias are enclosed. Enclosing them may show everyman that this is &quot;a&quot; Cy Young rather than &quot;the&quot; Cy Young.\n\nand speaking of baseball, great catch on it being a railroad baggage car.","CakesPix: Thanks for your suggestion.  We'll have to keep the title &quot;as is&quot; here since we transcribe titles exactly as they appear on the item, and then provide additional clarification in brackets or with a note.","awesome","<a href=\"http://en.wikipedia.org/wiki/Irv_Young\" rel=\"nofollow\">en.wikipedia.org/wiki/Irv_Young</a>","i love old pictures it smells so good","Very Nice! I like it!\n\nJoey <a href=\"http://www.gamegratuit.fr/#http://www.flickr.com/photos/\">Jeux Ben 10</a>","I live in a small town in Eastern Maine (Milbridge, pop 1200) Mr. Young was born in a couple of towns over.","This description of a game in which he pitched might be of interest <a href=\"http://books.google.ca/books?id=lrmMrCH-MTEC&amp;pg=PA17&amp;lpg=PA17&amp;dq=irving+melrose+young&amp;source=bl&amp;ots=9aiKYDNJ6g&amp;sig=TyN6TwZnlOW6wZ5lXgfoCPXJ3W8&amp;hl=en&amp;sa=X&amp;ei=2F_NU_HqMsmrigK7qoDQDA&amp;ved=0CD0Q6AEwCw#v=onepage&amp;q=irving%20melrose%20young&amp;f=false\" rel=\"nofollow\">books.google.ca/books?id=lrmMrCH-MTEC&amp;pg=PA17&amp;lpg...</a>","Maine","Kiukiang Institute was a Methodist Episcopal organization that proselytized in China.\n\n&quot;The six months which have elapsed since the last Annual Meeting have been almost entirely free from the disquieting rumors which have disturbed other parts of China, and throughout the district the old time confidence and friendliness have been largely restored. At Hwang-mei Hsien serious trouble was threatened. Preaching services were interrupted, the chapel defaced, the preacher's house stoned, and he and his family subjected to much annoyance and discomfort, if not actual clanger. An appeal was made to the United States consul at Hankow, who promptly represented the case to the viceroy, and quiet was immediately restored. At Sha-ho, ChSn, the magistrate of the Teh-hwa District, while visiting the place on official business, publicly incited the gentry and people to riot and violence. He is a Hunan man, and is bitterly antiforeign. Happily there was no actual outbreak, but it has had a marked effect upon the people. The facts in the case were communicated to the United States minister, and doubtless the magistrate will be punished.&quot;\n\n&quot;The work has gone steadily forward in all departments. In the Kiu- kiang Institute we had a gracious, old-fashioned revival with over thirty conversions. The blessed influence of this outpouring of God's Spirit was felt through the whole district. The older circuits are ripe for a similar work, and we are looking and praying for a mighty revival which shall roll over the entire Kiukiang District.&quot;\n\nSource: Annual Report of the Missionary Society of the Methodist Episcopal Church, 1893","Thank you Richard Norton, for the additional information about the Kiukiang Institute. We will add some of it to the record when we update.","i wish i was born in the 1910s and witnessed this orphans going to coney island in autos and have this photos as  one of my  souveneirs. 'great photos'...","Just like <a href=\"http://www.flickr.com/photos/library_of_congress/2163513118/\">another LOC photo</a>, this was taken on the north side of New York City's Union Square, on East 17th Street to be specific. In fact, I've found <a href=\"http://www.flickr.com/photos/hegemonic/1023679254/\">a modern photo on flickr</a> (not mine, btw) whose scope and angle closely matches this one! It seems that all of the buildings on Union Square East in this photo--save for the very tall one on the right--are gone, but that many (maybe all) of the ones behind them are still around.","This was the seventh annual auto excursion of Brooklyn orphans to Coney Island, sponsored by volunteer drivers from the Automobile Club, according to this NYT story:\r\n<a href=\"http://query.nytimes.com/mem/archive-free/pdf?_r=1&amp;res=9E04E6DC1F3AE633A25754C0A9629C946296D6CF&amp;oref=slogin\">query.nytimes.com/mem/archive-free/pdf?_r=1&amp;res=9E04E...</a>","This image has been used in the indicommons.org post <a href=\"http://www.indicommons.org/2009/01/16/first-of-the-commons/\">First of The Commons</a>, on the first anniversary of the Library of Congress and Flickr's pilot launch.\n\n<a href=\"http://indicommons.org/\"><img src=\"http://indicommons.org/images/indicommonsURL.png\" alt=\"indicommons.org badge\" /></a>","George Borgfeldt &amp; Company\n\nGeorge Borgfeldt &amp; Company was located in New York (1881-1950's) and was an importer and assembler of dolls for the American and Canadian doll markets.\n\nSource: <a href=\"http://www.dollreference.com/george_borgfeldt_dolls.html\">www.dollreference.com/george_borgfeldt_dolls.html</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/989452@N20/\">German vintage Trucks Deutsche Klassik LKW</a>, and we'd love to have this added to the group!","The leading truck must be English since the steering wheel is on the opposite side........Neat picture.","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1094803@N22/\">free and proud</a>, and we'd love to have this added to the group!","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/972473@N24/\">piece of heaven</a>, and we'd love to have this added to the group!","Interesting that they were hauling orphans to Luna Park only ten days after Dreamland burned:\n<a href=\"http://www.flickr.com/photos/library_of_congress/2162672387/\">www.flickr.com/photos/library_of_congress/2162672387/</a>","Hi, I'm an admin for a group called <a href=\"http://www.flickr.com/groups/1304007@N21/\">FLICKR PARA LA HISTORIA </a>, and we'd love to have this added to the group!","A historic image of Coney Island's past - there are many plans for changes now, in 2010, for the rebirth of this great destination!","Fascinating glimpse into the past...","The plaque on the side of the first vehicle Says Bussing 6-ton truck, which makes it German in origin.","<b> Please join group if you have not already\nand share your photos and videos for all to see.\n<a href=\"http://www.flickr.com/groups/1414874@N24/\"><img src=\"http://farm4.static.flickr.com/4045/4688000370_54ccd2b167_o.jpg\" /></a>\n<a href=\"http://www.flickr.com/groups/141874@N24/\"><b> </b></a>\nPLANET EARTH BACK IN THE DAY\nThis group is dedicated to the past.\n<a href=\"http://www.flickr.com/groups/1414874@N24/\">www.flickr.com/groups/1414874@N24/</a></b>","<a href=\"http://www.flickr.com/groups/1414874@N24/\"><img src=\"http://farm5.static.flickr.com/4084/5012642921_051f209f3f_o.jpg\" width=\"100\" height=\"95\" alt=\"bid2\" />\n<a href=\"http://www.flickr.com/groups/141874@N24/\"><b> </b></a>\nPLANET EARTH BACK IN THE DAY\nThis group is dedicated to the past.\n<a href=\"http://www.flickr.com/groups/1414874@N24/\">www.flickr.com/groups/1414874@N24/</a>\nPLANET EARTH groups.\n<a href=\"http://www.thatsrightphotography.com/test.html\" rel=\"nofollow\">www.thatsrightphotography.com/test.html</a></a>","[https://www.flickr.com/photos/70251312@N00]   The correct link to the 1911 Orphans Day story is <a href=\"http://query.nytimes.com/mem/archive-free/pdf?res=9502E0D91431E233A2575BC0A9609C946096D6CF\" rel=\"nofollow\">query.nytimes.com/mem/archive-free/pdf?res=9502E0D91431E2...</a>","I am revisiting the first post in the series. It looks like the event was called &quot;New York Orphans Automobile Day&quot; and it was an annual event. <a href=\"https://www.nytimes.com/search?query=Orphans%20Automobile%20Day\" rel=\"noreferrer nofollow\">www.nytimes.com/search?query=Orphans%20Automobile%20Day</a> \nI started an entry in Wikidata: <a href=\"https://www.wikidata.org/wiki/Q96099518\" rel=\"noreferrer nofollow\">www.wikidata.org/wiki/Q96099518</a>"],"ids":["8602872-2162649923-72157605039599531","8602872-2162649923-72157610668687071","8602872-2162649923-72157610701863229","8602872-2162649923-72157610705701917","8602872-2162649923-72157614543115571","8602872-2162649923-72157615412704263","8602872-2162649923-72157620619835550","8602872-2162649923-72157623031768040","8602872-2162649923-72157624733828706","8602872-2162649923-72157631846766125","8602872-2162649923-72157714957276112","8602872-2162649635-72157603737361003","8602872-2162649635-72157603767161877","8602872-2162649635-72157603764198182","8602872-2162649635-72157603786143914","8602872-2162649635-72157603802628146","8602872-2162649635-72157603808099413","8602872-2162649635-72157603828622845","8602872-2162649635-72157604026960214","8602872-2162649635-72157604058532057","8602872-2162649635-72157604059842566","8602872-2162649635-72157604141776031","8602872-2162649635-72157604558828319","8602872-2162649635-72157605648348109","8602872-2162649635-72157608198124185","8602872-2162649635-72157614096960778","8602872-2162649635-72157614542294321","8602872-2162649635-72157615651491595","8602872-2162649635-72157615662806679","8602872-2162649635-72157615883763962","8602872-2162649635-72157616177278719","8602872-2162649635-72157616186920155","8602872-2162649635-72157620901546812","8602872-2162649635-72157622012004011","8602872-2162649635-72157622337201842","8602872-2162649635-72157671691654575","8602872-2162649383-72157603816873242","8602872-2162649383-72157611475021327","8602872-2162649383-72157624109532784","8602872-2162649157-72157603770350438","8602872-2162649157-72157611475265799","8602872-2162649157-72157615984307808","8602872-2162649157-72157624652904769","8602872-2163449614-72157603732495548","8602872-2163449614-72157603739906186","8602872-2163449614-72157603756693705","8602872-2163449614-72157603754269726","8602872-2163449614-72157603839721992","8602872-2163449614-72157624011338935","8602872-2163449614-72157624769411964","8602872-2163449614-72157625874948580","8602872-2163449292-72157603754428765","8602872-2163449292-72157603820313375","8602872-2163449292-72157622907210457","8602872-2163449292-72157625524607950","8602872-2163449292-72157632777858812","8602872-2163449292-72157686177579122","8602872-2163449292-72157694600596454","8602872-2163449080-72157606632176132","8602872-2163449080-72157627881863559","8602872-2163448880-72157603794885383","8602872-2163448880-72157605233104297","8602872-2163448880-72157623509748126","8602872-2163448880-72157628117993710","8602872-2163448880-72157720326567911","8602872-2163448712-72157603761038820","8602872-2163448712-72157603843074427","8602872-2163448492-72157603746660949","8602872-2163448492-72157603814255157","8602872-2163448492-72157603839747656","8602872-2163448492-72157605651517822","8602872-2163448492-72157606348540708","8602872-2163448492-72157612201761459","8602872-2163448492-72157612289809328","8602872-2163448492-72157617796412784","8602872-2163448492-72157622252070757","8602872-2163448492-72157623985257107","8602872-2163448492-72157628377220929","8602872-2163448270-72157603839750646","8602872-2163448066-72157604347676753","8602872-2163448066-72157629779063324","8602872-2163448066-72157631575958351","8602872-2163448066-72157631754095612","8602872-2162647149-72157603839765872","8602872-2162646943-72157603735487894","8602872-2162646943-72157612938921063","8602872-2162646943-72157617408555453","8602872-2162646943-72157623104498835","8602872-2162646579-72157603746631783","8602872-2162646579-72157603749400521","8602872-2162646579-72157603839771602","8602872-2162646579-72157607009402864","8602872-2162646579-72157611023361302","8602872-2162646579-72157622085796594","8602872-2162646403-72157603728007286","8602872-2162646403-72157603728058724","8602872-2162646403-72157603728586360","8602872-2162646403-72157603733388191","8602872-2162646403-72157603734390801","8602872-2162646403-72157603734424523","8602872-2162646403-72157603734600175","8602872-2162646403-72157603732212526","8602872-2162646403-72157603737774571","8602872-2162646403-72157603734736278","8602872-2162646403-72157603734789236","8602872-2162646403-72157603736806150","8602872-2162646403-72157603744730487","8602872-2162646403-72157603741256560","8602872-2162646403-72157603745416020","8602872-2162646403-72157603751220441","8602872-2162646403-72157603752084113","8602872-2162646403-72157603754739777","8602872-2162646403-72157603753427906","8602872-2162646403-72157603768306071","8602872-2162646403-72157603776939400","8602872-2162646403-72157603782867955","8602872-2162646403-72157603781807436","8602872-2162646403-72157603790883575","8602872-2162646403-72157603797174911","8602872-2162646403-72157603798777216","8602872-2162646403-72157603805051331","8602872-2162646403-72157603805874601","8602872-2162646403-72157603817883334","8602872-2162646403-72157603844206377","8602872-2162646403-72157603862901552","8602872-2162646403-72157603868626639","8602872-2162646403-72157604011269247","8602872-2162646403-72157604039176263","8602872-2162646403-72157604476269868","8602872-2162646403-72157604838239220","8602872-2162646403-72157605025154962","8602872-2162646403-72157605142242121","8602872-2162646403-72157606130701717","8602872-2162646403-72157606632381976","8602872-2162646403-72157607592786933","8602872-2162646403-72157608117358620","8602872-2162646403-72157609305746706","8602872-2162646403-72157609402012657","8602872-2162646403-72157609662153974","8602872-2162646403-72157609938943029","8602872-2162646403-72157609939074315","8602872-2162646403-72157610762606820","8602872-2162646403-72157611014972952","8602872-2162646403-72157611354060390","8602872-2162646403-72157611327157299","8602872-2162646403-72157611578556748","8602872-2162646403-72157611903870435","8602872-2162646403-72157612113234972","8602872-2162646403-72157613241110542","8602872-2162646403-72157613457398579","8602872-2162646403-72157614081761217","8602872-2162646403-72157614181544202","8602872-2162646403-72157614864577298","8602872-2162646403-72157614872768894","8602872-2162646403-72157615060548410","8602872-2162646403-72157615115821443","8602872-2162646403-72157615651241171","8602872-2162646403-72157615667574899","8602872-2162646403-72157616086355694","8602872-2162646403-72157616300332975","8602872-2162646403-72157616785591043","8602872-2162646403-72157616964658388","8602872-2162646403-72157616952544453","8602872-2162646403-72157617466659403","8602872-2162646403-72157617545742253","8602872-2162646403-72157617545746299","8602872-2162646403-72157617637413863","8602872-2162646403-72157617882687639","8602872-2162646403-72157617882753069","8602872-2162646403-72157618159168236","8602872-2162646403-72157618314915710","8602872-2162646403-72157618456871163","8602872-2162646403-72157618673654679","8602872-2162646403-72157618733218707","8602872-2162646403-72157618768865679","8602872-2162646403-72157619198218306","8602872-2162646403-72157619402996750","8602872-2162646403-72157619643693859","8602872-2162646403-72157619874453074","8602872-2162646403-72157620972190337","8602872-2162646403-72157621108098860","8602872-2162646403-72157621576688517","8602872-2162646403-72157621815991463","8602872-2162646403-72157621993807026","8602872-2162646403-72157622013131731","8602872-2162646403-72157622160866874","8602872-2162646403-72157622258851683","8602872-2162646403-72157622476332538","8602872-2162646403-72157622571853155","8602872-2162646403-72157622710046656","8602872-2162646403-72157622765327456","8602872-2162646403-72157622837823026","8602872-2162646403-72157622897275240","8602872-2162646403-72157623104485663","8602872-2162646403-72157623277886934","8602872-2162646403-72157623278031881","8602872-2162646403-72157623464968126","8602872-2162646403-72157623479447962","8602872-2162646403-72157623874775164","8602872-2162646403-72157623790664549","8602872-2162646403-72157624380951926","8602872-2162646403-72157624394941108","8602872-2162646403-72157624469460819","8602872-2162646403-72157624594160540","8602872-2162646403-72157624469463117","8602872-2162646403-72157624469463945","8602872-2162646403-72157624594163782","8602872-2162646403-72157624469466653","8602872-2162646403-72157624469467497","8602872-2162646403-72157624718301292","8602872-2162646403-72157624991745020","8602872-2162646403-72157625112369866","8602872-2162646403-72157625153130496","8602872-2162646403-72157625157033798","8602872-2162646403-72157625064612375","8602872-2162646403-72157625350254966","8602872-2162646403-72157625616404660","8602872-2162646403-72157625692560996","8602872-2162646403-72157625577170681","8602872-2162646403-72157625720567984","8602872-2162646403-72157625611506179","8602872-2162646403-72157625684529183","8602872-2162646403-72157626078814195","8602872-2162646403-72157626793301408","8602872-2162646403-72157627474954251","8602872-2162646403-72157630691785324","8602872-2162646403-72157632223938450","8602872-2162646403-72157632370998053","8602872-2162646403-72157632701499430","8602872-2162646403-72157633231971888","8602872-2162646403-72157634713496604","8602872-2162646403-72157635105743337","8602872-2162646403-72157635157306022","8602872-2162646403-72157653573169269","8602872-2162646403-72157695695679701","8602872-2162646403-72157711957383961","8602872-2162646403-72157718008446826","8602872-2162646403-72157719457651989","8602872-2162646403-72157720316267543","8602872-2162646403-72157720316705626","8602872-2162646403-72157720331938413","8602872-2162646219-72157603734167178","8602872-2162646219-72157603739721101","8602872-2162646219-72157607443491595","8602872-2162646219-72157624563497083","8602872-2162646219-72157624688091006","8602872-2162646219-72157624688154876","8602872-2162646219-72157624563687749","8602872-2162646219-72157624563920267","8602872-2162645983-72157603735998319","8602872-2162645983-72157603738876627","8602872-2162645983-72157603751288365","8602872-2162645983-72157603750490202","8602872-2162645983-72157603754725149","8602872-2162645983-72157603761910156","8602872-2162645983-72157603774927786","8602872-2162645983-72157603811208995","8602872-2162645983-72157603818994654","8602872-2162645983-72157603825647655","8602872-2162645983-72157603875170399","8602872-2162645983-72157603875200251","8602872-2162645983-72157603890975512","8602872-2162645983-72157610009695537","8602872-2162645983-72157611229262791","8602872-2162645983-72157613603438868","8602872-2162645983-72157618638510858","8602872-2162645983-72157618559348241","8602872-2162645983-72157619111162094","8602872-2162645983-72157619027504183","8602872-2162645983-72157619030190265","8602872-2162645983-72157622023798370","8602872-2162645983-72157622696310506","8602872-2162645983-72157622907205695","8602872-2162645983-72157629377907647","8602872-2162645983-72157629401467515","8602872-2162645983-72157629660796909","8602872-2163446486-72157606006216486","8602872-2163446486-72157608290423579","8602872-2163446486-72157623031755926","8602872-2163446486-72157639548470553","8602872-2162645565-72157603738460014","8602872-2162645565-72157603746585576","8602872-2162645565-72157603802203548","8602872-2162645565-72157605849393875","8602872-2162645565-72157613422579289","8602872-2162645565-72157621684943591","8602872-2162645565-72157624838193208","8602872-2162645565-72157624713854949","8602872-2162645565-72157625180156525","8602872-2162645323-72157603735005907","8602872-2162645323-72157603734130440","8602872-2162645323-72157603743756348","8602872-2162645323-72157603744755986","8602872-2162645323-72157603748640127","8602872-2162645323-72157603777235078","8602872-2162645323-72157604255655960","8602872-2162645323-72157604620383063","8602872-2162645323-72157604625153474","8602872-2162645323-72157605092643437","8602872-2162645323-72157615665423296","8602872-2162645323-72157615812999136","8602872-2162645323-72157616212517553","8602872-2162645323-72157622234431314","8602872-2162645323-72157622873932553","8602872-2162645323-72157627043647992","8602872-2162645323-72157629778981464","8602872-2162645323-72157645413529369","8602872-2162645323-72157671320145133","8602872-2162645133-72157613603282538","8602872-2162645133-72157624941375087","8602872-2163445674-72157603741143938","8602872-2163445674-72157603768092510","8602872-2163445674-72157603815201434","8602872-2163445674-72157612647737814","8602872-2163445674-72157613574355319","8602872-2163445674-72157614472212548","8602872-2163445674-72157614849961571","8602872-2163445674-72157616795514929","8602872-2163445674-72157616795534095","8602872-2163445674-72157622034687657","8602872-2163445674-72157622907195167","8602872-2163445674-72157623469874244","8602872-2163445674-72157623790673891","8602872-2163445674-72157624064077366","8602872-2163445674-72157625404233678","8602872-2163445674-72157625409947334","8602872-2163445674-72157667605212493","8602872-2163445674-72157714603247752"],"index":19,"size":328,"start":95000,"end":95328}